* Applicative functors
In this section, we'll take a look at applecative functors, which are beefed up functors, represented in Haskell by the =Applicative= typeclass, found in the =Control.Applicative= module.

When we were mapping functions over functors, we usually mapped functions that take only one parameter.
But what happens when we map a function like =*=, which takes two parameters, over a functor?
If we have =Just 3= and we do =fmap (*) (Just 3)=, what do we get?
From the instance implementation of =Maybe= for =Functor=, we know that if it's a =Just something= value, it will apply the function to the =something= inside the =Just=.
Therefore, doing =fmap (*) (Just 3)= result in =Just ((*) 3)=, which can also be written as =Just (* 3)= if we use sections.

#+begin_src haskell
  :t fmap compare (Just 'a')
#+end_src

#+RESULTS:
: fmap compare (Just 'a') :: Maybe (Char -> Ordering)

We see how by mapping "multi-parameter" functions over functors, we get functors that contain functions inside them. So now what can we do with them?
Well for one, we can map functions that take these functions as parameters over them, because whetever is inside a functor will be given to the function that we're mapping over it as a parameter.

#+begin_src haskell
  :{
    let a = fmap (*) [1,2,3,4]
  :}

  fmap (\f -> f 9) a
#+end_src

#+RESULTS:
: Prelude> [9,18,27,36]

But what if we have a functor value of =Just (3 *)= and a functor value of =Just 5= and we want to take out the function from =Just (3 *)= and map it over =Just 5=?
With normal functors, we're out of luck, because all they support is just mapping normal functinos over existing functors.

Meet the =Applicative= typeclass. It lies in the =Control.Applicative= module and it defines two methods, =pure= and =<*>=.
It doesn't provide a default implementation for any of them, so we have to define them both if we want something to be an applicative functor.
The class is defined like so:

#+begin_src haskell
  class (Functor f) => Applicative f where
      pure :: a -> f a
      (<*>) :: f (a -> b) -> f a -> f b
#+end_src

This simple three line class definition tells us a lot! Let's start at the first line.
It starts the definition of the =Applicative= class and it also introduces a class constraint.
It says that if we want to make a type constructor part of the =Applicative= typeclass, it has to be in =Functor= first.
That's why if we know that if a type constructor is part of the =Applicative= typeclass, it's also in =Functor=, so we can use =fmap= on it.

The first method it defines is called =pure=.
Which takes a value and puts it in some sort of default (or pure) context - a minimal context that still yields that value.

The =<*>= function is really interesting. It has a type declaration of =f (a -> b) -> f a -> f b=.
Which remembers a lot of =fmap=. Whereas =fmap= takes a function and a functor and applies the function inside the functor, =<*>= takes a functor that has a function in it and another functor and sort of extracts that function from the first functor and then maps it over the second one.
When I say /extract/, I actually sort of mean /run/ and then extract, maybe even /sequence/.

** On newtype laziness

We mentioned that /newtype/ is usually faster that /data/.
The only thing that can be done with /newtype/ is turning an existing type into a new type, so internally, Haskell can represent the values of types defined with /newtype/ just like the original one, only it has to keep in mind that the their types are now distinct.
This fact means that not only is /newtype/ faster, it's alto lazier.

Like we've said before, Haskell is lazy by default, which means that only when we try to actually print the results of our functions will any computation take place.

Now, consider the following type:
#+begin_src haskell
data CoolBool = CoolBool { getCoolBool :: Bool }
#+end_src

#+RESULTS:

It's your run-of-the-millalgebraic data type that was defined with the /data/ keyword.
It has one value constructor, which has one field whose type is =Bool=.
Let's make a function that pattern matches on a =CoolBool= and returns the value ="hello"= regardless of whether the =Bool= inside the =CoolBool= was =True= of =False=:
#+begin_src haskell
  helloMe :: CoolBool -> String
  helloMe (CoolBool _) = "hello"
#+end_src

#+RESULTS:
: <interactive>:3:10-17: error:
:     Not in scope: data constructor ‘CoolBool’

Instead of applying this function to a normal =CoolBool=, let's throw it a curveball and apply it to =undefined=
#+begin_src haskell
helloMe undefined
#+end_src

#+RESULTS:
: "*** Exception: Prelude.undefined
: CallStack (from HasCallStack):
:   error, called at libraries/base/GHC/Err.hs:79:14 in base:GHC.Err
:   undefined, called at <interactive>:10:9 in interactive:Ghci6

Yikes, an exception!
Now why did this exception happen? Types defined with the /data/ keyword can have multiple value constructors (even though =CoolBool= only has one).
So in order to see if the value given to our function conforms to the =(CoolBool _)= pattern, Haskell has to evaluate the value just enough to see which value constructor was used when we made the value.
And when we try to evaluate an =undefined= value, even a little, an exception is thrown.

Instead of using the /data/ keyword for =CoolBool=, let's try using /newtype/:
#+begin_src haskell
newtype CoolBool = CoolBool { getCoolBool :: Bool }
#+end_src

#+RESULTS:

And let's apply =helloMe= to an =undefined= value:
#+begin_src haskell
helloMe undefined
#+end_src

#+RESULTS:
: hello

It worked!
When we use /newtype/, Haskell can internally represent the values of the new type in the same way as the original values.
It doesn't have to add another box around them, it just has to be aware of the values being of different types.
And because Haskell knows that types made with the /newtype/ keyword can only have one constructor, it doesn't havi to evaluate the value passed to the function to make sure that it conforms to the =(CoolBool _)= pattern because /newtype/ types can only have one possible value constructor and one field.

*Whereas /data/ can be used do make your own types from scratch, /newtype/ is for making a completely new type out of an existing type.*
